
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <!--
This HTML was auto-generated from MATLAB code.
To make changes, update the MATLAB code and republish this document.
      --><title>RPL02:Se&ntilde;ales en tiempo continuo</title><meta name="generator" content="MATLAB 9.1"><link rel="schema.DC" href="http://purl.org/dc/elements/1.1/"><meta name="DC.date" content="2018-10-30"><meta name="DC.source" content="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez.m"><style type="text/css">
html,body,div,span,applet,object,iframe,h1,h2,h3,h4,h5,h6,p,blockquote,pre,a,abbr,acronym,address,big,cite,code,del,dfn,em,font,img,ins,kbd,q,s,samp,small,strike,strong,sub,sup,tt,var,b,u,i,center,dl,dt,dd,ol,ul,li,fieldset,form,label,legend,table,caption,tbody,tfoot,thead,tr,th,td{margin:0;padding:0;border:0;outline:0;font-size:100%;vertical-align:baseline;background:transparent}body{line-height:1}ol,ul{list-style:none}blockquote,q{quotes:none}blockquote:before,blockquote:after,q:before,q:after{content:'';content:none}:focus{outine:0}ins{text-decoration:none}del{text-decoration:line-through}table{border-collapse:collapse;border-spacing:0}

html { min-height:100%; margin-bottom:1px; }
html body { height:100%; margin:0px; font-family:Arial, Helvetica, sans-serif; font-size:10px; color:#000; line-height:140%; background:#fff none; overflow-y:scroll; }
html body td { vertical-align:top; text-align:left; }

h1 { padding:0px; margin:0px 0px 25px; font-family:Arial, Helvetica, sans-serif; font-size:1.5em; color:#d55000; line-height:100%; font-weight:normal; }
h2 { padding:0px; margin:0px 0px 8px; font-family:Arial, Helvetica, sans-serif; font-size:1.2em; color:#000; font-weight:bold; line-height:140%; border-bottom:1px solid #d6d4d4; display:block; }
h3 { padding:0px; margin:0px 0px 5px; font-family:Arial, Helvetica, sans-serif; font-size:1.1em; color:#000; font-weight:bold; line-height:140%; }

a { color:#005fce; text-decoration:none; }
a:hover { color:#005fce; text-decoration:underline; }
a:visited { color:#004aa0; text-decoration:none; }

p { padding:0px; margin:0px 0px 20px; }
img { padding:0px; margin:0px 0px 20px; border:none; }
p img, pre img, tt img, li img, h1 img, h2 img { margin-bottom:0px; } 

ul { padding:0px; margin:0px 0px 20px 23px; list-style:square; }
ul li { padding:0px; margin:0px 0px 7px 0px; }
ul li ul { padding:5px 0px 0px; margin:0px 0px 7px 23px; }
ul li ol li { list-style:decimal; }
ol { padding:0px; margin:0px 0px 20px 0px; list-style:decimal; }
ol li { padding:0px; margin:0px 0px 7px 23px; list-style-type:decimal; }
ol li ol { padding:5px 0px 0px; margin:0px 0px 7px 0px; }
ol li ol li { list-style-type:lower-alpha; }
ol li ul { padding-top:7px; }
ol li ul li { list-style:square; }

.content { font-size:1.2em; line-height:140%; padding: 20px; }

pre, code { font-size:12px; }
tt { font-size: 1.2em; }
pre { margin:0px 0px 20px; }
pre.codeinput { padding:10px; border:1px solid #d3d3d3; background:#f7f7f7; }
pre.codeoutput { padding:10px 11px; margin:0px 0px 20px; color:#4c4c4c; }
pre.error { color:red; }

@media print { pre.codeinput, pre.codeoutput { word-wrap:break-word; width:100%; } }

span.keyword { color:#0000FF }
span.comment { color:#228B22 }
span.string { color:#A020F0 }
span.untermstring { color:#B20000 }
span.syscmd { color:#B28C00 }

.footer { width:auto; padding:10px 0px; margin:25px 0px 0px; border-top:1px dotted #878787; font-size:0.8em; line-height:140%; font-style:italic; color:#878787; text-align:left; float:none; }
.footer p { margin:0px; }
.footer a { color:#878787; }
.footer a:hover { color:#878787; text-decoration:underline; }
.footer a:visited { color:#878787; }

table th { padding:7px 5px; text-align:left; vertical-align:middle; border: 1px solid #d6d4d4; font-weight:bold; }
table td { padding:7px 5px; text-align:left; vertical-align:top; border:1px solid #d6d4d4; }





  </style></head><body><div class="content"><h1>RPL02:Se&ntilde;ales en tiempo continuo</h1><!--introduction--><p>GARCIA MORALES PABLO</p><p>FERNANDEZ SANTANA VIVIANA ELIZABETH</p><p>2MV1</p><!--/introduction--><h2>Contents</h2><div><ul><li><a href="#1">Introduccion</a></li><li><a href="#2">ORIGEN</a></li><li><a href="#3">Alternativas de software libre</a></li><li><a href="#4">Desarrollo</a></li><li><a href="#7">M1.1</a></li><li><a href="#8">M1.2</a></li><li><a href="#9">M1.3</a></li><li><a href="#10">M1.4</a></li><li><a href="#12">6</a></li><li><a href="#13">7</a></li><li><a href="#14">Referencias</a></li></ul></div><h2 id="1">Introduccion</h2><p>MATLAB es un entorno de computaci&oacute;n y desarrollo de aplicaciones totalmente integrado orientado para llevar a cabo proyectos en donde se encuentren implicados elevados c&aacute;lculos matem&aacute;ticos y la visualizaci&oacute;n gr&aacute;fica de los mismos. MATLAB integra an&aacute;lisis num&eacute;rico, c&aacute;lculo matricial, proceso de se&ntilde;al y visualizaci&oacute;n gr&aacute;fica en un entorno completo donde los problemas y sus soluciones son expresados del mismo modo en que se escribirian radicionalmente, sin necesidad de hacer uso de la programaci&oacute;n tradicional. MATLAB dispone tambi&eacute;n en la actualidad de un amplio abanico de programas de apoyo especializados, denominados Toolboxes, que extienden significativamente el n&uacute;mero de funciones incorporadas en el programa principal. Estos Toolboxes cubren en la actualidad pr&aacute;cticamente casi todas las &aacute;reas principales en el mundo de la ingenier&iacute;a y la simulaci&oacute;n, destacando entre ellos el 'toolbox' de proceso de im&aacute;genes, se&ntilde;al, control robusto,estad&iacute;stica, an&aacute;lisis financiero, matem&aacute;ticas simb&oacute;licas, redes neurales, l&oacute;gica difusa, identificaci&oacute;n de sistemas, simulaci&oacute;n de sistemas din&aacute;micos, etc. es un entorno de c&aacute;lculo t&eacute;cnico, que se ha convertido en est&aacute;ndar de la industria, con capacidades no superadas en computaci&oacute;n y visualizaci&oacute;n num&eacute;rica. Integra los requisitos claves de un sistema de computaci&oacute;n t&eacute;cnico: c&aacute;lculo num&eacute;rico, gr&aacute;ficos, herramientas para aplicaciones especificas y capacidad de ejecuci&oacute;n en m&uacute;ltiples plataformas. Esta familia de productos proporciona al estudiante un medio de car&aacute;cter &uacute;nico, para resolver los problemas m&aacute;s complejos y dif&iacute;ciles.</p><h2 id="2">ORIGEN</h2><p>MATLAB nace como una soluci&oacute;n a la necesidad de mejores y mas poderosas herramientas de calculo para resolver problemas de calculo complejos en los que es necesario aprovechas las amplias capacidades de proceso de datos de grandes computadores. El nombre MATLAB viene de "matrix laboratory" (laboratorio matricial). MATLAB fue originalmente escrito para proveer acceso f&aacute;cil al softwarematricial desarrollado por los proyectos LINPACK y EISPACK, que juntos  representan el estado del arte e software para computaci&oacute;n matricial. Hoy MATLAB es usado en una variedad de &aacute;reas de aplicaci&oacute;n incluyendo procesamiento de se&ntilde;ales e im&aacute;genes, dise&ntilde;o de sistemas de control, ingenier&iacute;a financiera e investigaci&oacute;n m&eacute;dica. La arquitectura abierta facilita usar MATLAB y los productos que lo acompa&ntilde;an para explorar datos y crear herramientas personalizadas que proveen visiones profundas tempranas y ventajas competitivas.</p><h2 id="3">Alternativas de software libre</h2><p><b>GNU Octave</b> GNU Octave puede ser la alternativa m&aacute;s conocida a MATLAB. En desarrollo activo durante casi tres d&eacute;cadas, Octave se ejecuta en Windows, Mac y Linux, y est&aacute; empaquetado para la mayor&iacute;a de las distribuciones principales. Si est&aacute; buscando un proyecto que sea lo m&aacute;s parecido posible al lenguaje MATLAB real, Octave puede ser una buena opci&oacute;n para usted; se esfuerza por una compatibilidad exacta, por lo que muchos de sus proyectos desarrollados para MATLAB pueden ejecutarse en Octave sin necesidad de modificaciones. para mayor informacion entre al enlace <a href="https://www.gnu.org/software/octave/">https://www.gnu.org/software/octave/</a></p><p><b>Scilab</b> Scilab es otra opci&oacute;n de c&oacute;digo abierto para computaci&oacute;n num&eacute;rica que se ejecuta en todas las plataformas principales: Windows, Mac y Linux incluidos. Scilab es quiz&aacute;s la alternativa m&aacute;s conocida fuera de Octave, y (como Octave) es muy similar a MATLAB en su implementaci&oacute;n, aunque la compatibilidad exacta no es un objetivo de los desarrolladores del proyecto <a href="http://www.scilab.org/">http://www.scilab.org/</a></p><p><b>Sage</b> SageMath es otro sistema de software de matem&aacute;ticas de c&oacute;digo abierto que podr&iacute;a ser una buena opci&oacute;n para aquellos que buscan una alternativa de MATLAB. Est&aacute; construido sobre una variedad de conocidas bibliotecas de computaci&oacute;n cient&iacute;fica basadas en Python, y su propio lenguaje es sint&aacute;cticamente similar a Python. Tiene muchas caracter&iacute;sticas que incluyen una interfaz de l&iacute;nea de comandos, cuadernos basados en navegador, herramientas para incrustar f&oacute;rmulas en otros documentos y, por supuesto, muchas bibliotecas matem&aacute;ticas <a href="http://www.sagemath.org/index.html">http://www.sagemath.org/index.html</a></p><h2 id="4">Desarrollo</h2><pre class="language-matlab">
<span class="keyword">function</span> =func1(a,w)
fw=(a/(a^2+w^2));
<span class="keyword">end</span>

</pre><pre class="codeinput">  func2(1,-2:0.1:2);
</pre><img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_01.png" alt=""> <pre class="codeinput">   func3(-1:0.1:5);
</pre><img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_02.png" alt=""> <pre class="codeinput">   trans(-10:0.2:10);
</pre><img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_03.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_04.png" alt=""> <h2 id="7">M1.1</h2><pre class="codeinput">  f = @(t) exp(-t).*cos(2*pi.*t);
  t=(-2:2);
  figure
  plot(t,f(t));
xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'f(t)'</span>); grid;
t = (-2:0.01:2);
figure
plot(t,f(t));
xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'f(t)'</span>); grid;
</pre><img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_05.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_06.png" alt=""> <h2 id="8">M1.2</h2><pre class="codeinput"> u = @(t) t&gt;=0;
 t = (-2:2);
 figure
 plot (t,u(t));
 xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'u(t)'</span>);
 t = (-2:0.01:2);
 figure
 plot (t,u(t));
 xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'u(t)'</span>);
 axis ([-2 2 -0.1 1.1]);
 p = @(t) t&gt;=0 &amp; t&lt;1;
 t = (-1:0.01:2);
 figure
 plot(t,p(t));
 xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'p(t) = u(t)-u(t-1)'</span>);
 axis ([-1 2 -.1 1.1]);
</pre><img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_07.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_08.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_09.png" alt=""> <h2 id="9">M1.3</h2><pre class="codeinput">g = @(t) exp(-t).*cos(2*pi.*t).*(t&gt;=0);
t = (-2:0.01:2);
figure
plot(t,g(2*t+1)); xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'g(2t+1)'</span>); grid;
figure
plot(t,g(-t+1)); xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'g(-t+1)'</span>); grid;
figure
plot(t,g(2*t+1) +g(-t+1)); xlabel(<span class="string">'t'</span>); ylabel(<span class="string">'h(t)'</span>); grid;
</pre><img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_10.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_11.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_12.png" alt=""> <h2 id="10">M1.4</h2><pre class="codeinput">x = @(t) exp(-t).*((t&gt;=0)&amp;(t&lt;1));
t = (0:0.01:1);
Ex = sum(x(t).*x(t)*0.01)
x_squared = @(t) exp(-2.*t).*((t&gt;=0)&amp;(t&gt;1));
Ex = quad(x_squared,0,1)

g_squared = @(t) exp(-2*t).*((cos(2*pi*t)).^2).*(t&gt;=0);
t = (0:0.001:100);
 Eg = sum(g_squared(t)*0.001)
Eg = quad(g_squared, 0,100)
</pre><pre class="codeoutput">
Ex =

    0.4367


Ex =

     0


Eg =

    0.2567


Eg =

    0.2562

</pre><pre class="codeinput">f1= @(t) -t.*((t&lt;=0)&amp;(t&gt;-4))+t.*((t&gt;=0)&amp;(t&lt;2));
t=(-8:0.2:8);
figure
plot(t,f1(t)); title(<span class="string">'x(t)'</span>);
figure
plot(t,f1(t-4)); title(<span class="string">'x(t-4)'</span>);
figure
plot(t,f1(t/1.5)); title(<span class="string">'x(t/1.5)'</span>);
figure
plot(t,f1(2*t-4)); title(<span class="string">'x(2t-4)'</span>);
figure
plot(t,f1(2-t)); title(<span class="string">'x(2-t)'</span>);
</pre><img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_13.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_14.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_15.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_16.png" alt=""> <img vspace="5" hspace="5" src="ASySPractica2PabloGarcia_ASySPractica2VivianaFernandez_17.png" alt=""> <h2 id="12">6</h2><pre class="codeinput"><span class="comment">%</span>
</pre><h2 id="13">7</h2><h2 id="14">Referencias</h2><p>B.P.Lathi, <i>Linear Systems and Signals</i> , Oxford University Press, 2005, New York</p><p>Edison Del Rosario. (2017). Se&ntilde;ales de Energ&iacute;a y Potencia. 29/10/18, de Wordpress Sitio web: <a href="http://blog.espol.edu.ec/telg1001/senales-de-energia-y-potencia/">http://blog.espol.edu.ec/telg1001/senales-de-energia-y-potencia/</a></p><p>Rafael Martinez Martinez. (2018). Practica 2: Se&ntilde;ales continuas. 29/10/18, de MATLAB Sitio web: <a href="http://rafneta.github.io/Practica2ASySOctubre2018/Prac2ASySOctubre2018.html">http://rafneta.github.io/Practica2ASySOctubre2018/Prac2ASySOctubre2018.html</a></p><p>Danilo &#352;?epanovi?. (2010). Variables, Scripts, and Operations. 29/10/18, de IAP Sitio web: https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-094-introduction-to-matlab-january-iap-2010/lecture-notes/MIT6_094IAP10_lec01.pdf</p><p class="footer"><br><a href="http://www.mathworks.com/products/matlab/">Published with MATLAB&reg; R2016b</a><br></p></div><!--
##### SOURCE BEGIN #####
%% RPL02:Señales en tiempo continuo
% GARCIA MORALES PABLO
%
% FERNANDEZ SANTANA VIVIANA ELIZABETH
%
% 2MV1
%%
%% Introduccion
% MATLAB es un entorno de computación y desarrollo de aplicaciones totalmente integrado orientado para llevar a cabo proyectos en donde se encuentren implicados elevados cálculos matemáticos y la visualización gráfica de los mismos.
% MATLAB integra análisis numérico, cálculo matricial, proceso de señal y visualización gráfica en un entorno completo donde los problemas y sus soluciones son expresados del mismo modo en que se escribirian radicionalmente, sin necesidad de hacer uso de la programación tradicional.
% MATLAB dispone también en la actualidad de un amplio abanico de programas de apoyo especializados, denominados Toolboxes, que extienden significativamente el número de funciones incorporadas en el programa principal. 
% Estos Toolboxes cubren en la actualidad prácticamente casi todas las áreas principales en el mundo de la ingeniería y la simulación, destacando entre ellos el 'toolbox' de proceso de imágenes, señal, control robusto,estadística, análisis financiero, matemáticas simbólicas, redes neurales, lógica difusa, identificación de sistemas, simulación de sistemas dinámicos, etc. es un entorno de cálculo técnico, que se ha convertido en estándar de la industria, con capacidades no superadas en computación y visualización numérica.
% Integra los requisitos claves de un sistema de computación técnico: cálculo numérico, gráficos, herramientas para aplicaciones especificas y capacidad de ejecución en múltiples plataformas. Esta familia de productos proporciona al estudiante un medio de carácter único, para resolver los problemas más complejos y difíciles.
%%% ORIGEN
% MATLAB nace como una solución a la necesidad de mejores y mas poderosas herramientas de calculo para resolver problemas de calculo complejos en los que es necesario aprovechas las amplias capacidades de proceso de datos de grandes computadores.
% El nombre MATLAB viene de "matrix laboratory" (laboratorio matricial). MATLAB fue originalmente escrito para proveer acceso fácil al softwarematricial desarrollado por los proyectos LINPACK y EISPACK, que juntos  representan el estado del arte e software para computación matricial.
% Hoy MATLAB es usado en una variedad de áreas de aplicación incluyendo procesamiento de señales e imágenes, diseño de sistemas de control, ingeniería financiera e investigación médica. La arquitectura abierta facilita usar MATLAB y los productos que lo acompañan para explorar datos y crear herramientas personalizadas que proveen visiones profundas tempranas y ventajas competitivas.
%%% Alternativas de software libre
% *GNU Octave*
% GNU Octave puede ser la alternativa más conocida a MATLAB. En desarrollo activo durante casi tres décadas, Octave se ejecuta en Windows, Mac y Linux, y está empaquetado para la mayoría de las distribuciones principales. Si está buscando un proyecto que sea lo más parecido posible al lenguaje MATLAB real, Octave puede ser una buena opción para usted; se esfuerza por una compatibilidad exacta, por lo que muchos de sus proyectos desarrollados para MATLAB pueden ejecutarse en Octave sin necesidad de modificaciones.
% para mayor informacion entre al enlace <https://www.gnu.org/software/octave/>
% 
% *Scilab*
% Scilab es otra opción de código abierto para computación numérica que se ejecuta en todas las plataformas principales: Windows, Mac y Linux incluidos. 
% Scilab es quizás la alternativa más conocida fuera de Octave, y (como Octave) es muy similar a MATLAB en su implementación, aunque la compatibilidad exacta no es un objetivo de los desarrolladores del proyecto <http://www.scilab.org/>
% 
% *Sage*
% SageMath es otro sistema de software de matemáticas de código abierto que podría ser una buena opción para aquellos que buscan una alternativa de MATLAB. Está construido sobre una variedad de conocidas bibliotecas de computación científica basadas en Python, y su propio lenguaje es sintácticamente similar a Python.
% Tiene muchas características que incluyen una interfaz de línea de
% comandos, cuadernos basados en navegador, herramientas para incrustar fórmulas en otros documentos y, por supuesto, muchas bibliotecas matemáticas <http://www.sagemath.org/index.html>
%% Desarrollo
% <include>func1.m</include>
%
  func2(1,-2:0.1:2);
%%
   func3(-1:0.1:5);
 %%
   trans(-10:0.2:10);
 
  %% M1.1
  
  f = @(t) exp(-t).*cos(2*pi.*t);
  t=(-2:2);
  figure
  plot(t,f(t));
xlabel('t'); ylabel('f(t)'); grid;
t = (-2:0.01:2);
figure
plot(t,f(t));
xlabel('t'); ylabel('f(t)'); grid;
%% M1.2
 u = @(t) t>=0;
 t = (-2:2);
 figure
 plot (t,u(t));
 xlabel('t'); ylabel('u(t)');
 t = (-2:0.01:2);
 figure
 plot (t,u(t));
 xlabel('t'); ylabel('u(t)');
 axis ([-2 2 -0.1 1.1]);
 p = @(t) t>=0 & t<1;
 t = (-1:0.01:2);
 figure
 plot(t,p(t));
 xlabel('t'); ylabel('p(t) = u(t)-u(t-1)');
 axis ([-1 2 -.1 1.1]);
 
%% M1.3
g = @(t) exp(-t).*cos(2*pi.*t).*(t>=0);
t = (-2:0.01:2);
figure
plot(t,g(2*t+1)); xlabel('t'); ylabel('g(2t+1)'); grid;
figure
plot(t,g(-t+1)); xlabel('t'); ylabel('g(-t+1)'); grid;
figure
plot(t,g(2*t+1) +g(-t+1)); xlabel('t'); ylabel('h(t)'); grid;

%% M1.4
x = @(t) exp(-t).*((t>=0)&(t<1));
t = (0:0.01:1);
Ex = sum(x(t).*x(t)*0.01)
x_squared = @(t) exp(-2.*t).*((t>=0)&(t>1));
Ex = quad(x_squared,0,1)

g_squared = @(t) exp(-2*t).*((cos(2*pi*t)).^2).*(t>=0);
t = (0:0.001:100);
 Eg = sum(g_squared(t)*0.001)
Eg = quad(g_squared, 0,100)

%%
f1= @(t) -t.*((t<=0)&(t>-4))+t.*((t>=0)&(t<2));
t=(-8:0.2:8);
figure
plot(t,f1(t)); title('x(t)');
figure
plot(t,f1(t-4)); title('x(t-4)');
figure
plot(t,f1(t/1.5)); title('x(t/1.5)');
figure
plot(t,f1(2*t-4)); title('x(2t-4)');
figure
plot(t,f1(2-t)); title('x(2-t)');
%% 6


% 
%% 7

%% Referencias
% B.P.Lathi, _Linear Systems and Signals_ , Oxford University Press, 2005,
% New York
% 
% Edison Del Rosario. (2017). Señales de Energía y Potencia. 29/10/18, de Wordpress Sitio web: http://blog.espol.edu.ec/telg1001/senales-de-energia-y-potencia/
% 
% Rafael Martinez Martinez. (2018). Practica 2: Señales continuas. 29/10/18, de MATLAB Sitio web: http://rafneta.github.io/Practica2ASySOctubre2018/Prac2ASySOctubre2018.html
%
% Danilo Š?epanovi?. (2010). Variables, Scripts, and Operations. 29/10/18, de IAP Sitio web: https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-094-introduction-to-matlab-january-iap-2010/lecture-notes/MIT6_094IAP10_lec01.pdf
%
%
%
%



 


##### SOURCE END #####
--></body></html>